package com.glt.designpattern;

public class InitMain {

    public static void main(String[] args) {
        /**
         * 模式分类
         *
         *  创建型
         *      创建型模式涉及到将对象实例化，这类模式都提供一个方法，将客户从所需要的实例化的对象中解耦
         *      单例
         *      建造者
         *      原型
         *      抽象工厂
         *      工厂方法
         *
         *  行为型
         *      涉及到类和对象如何交互及分配职责
         *      模板方法
         *      访问者
         *      中介者
         *      迭代器
         *      命令
         *      备忘录
         *      解释器
         *      责任链
         *      状态
         *      策略
         *
         *  结构型
         *      结构型模式可以让你把类或者对象组合到更大的结构中去
         *      代理
         *      桥接
         *      蝇量
         *      适配器
         *      外观
         *      组合
         *      装饰者
         */
    }
}
